title: Declarations
description: The payload that applies a set of declarations to the device through
  the Settings app.
payload:
  payloadtype: com.apple.declarations
  supportedOS:
    iOS:
      introduced: '17.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: forbidden
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '14.0'
      multiple: true
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: '17.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
    visionOS:
      introduced: '1.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    watchOS:
      introduced: '10.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
payloadkeys:
- key: Declarations
  title: Declarations
  type: <array>
  presence: required
  content: The set of declarations to apply. The array items are Base64-encoded data
    representations of the declaration JSON data.
  subkeys:
  - key: DeclarationsItem
    title: Declarations Content Item
    type: <data>
    presence: required
    content: An item in the declarations list
notes:
- title: ''
  content: |-
    This profile applies a set of declarations to the device. Users use this profile to install declarations without requiring an MDM enrollment. A device management server can't install a configuration profile containing this payload type. Device management servers need to use declarative device management to install declarations.

    > Important:
    > When a user installs the profile, the device only applies configuration declarations that allow a "local" enrollment. Consult the documentation for each configuration type to see if you can use it.
