title: Home Screen Layout
description: The payload that configures the Home Screen layout.
payload:
  payloadtype: com.apple.homescreenlayout
  supportedOS:
    iOS:
      introduced: '9.3'
      multiple: false
      supervised: true
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: '11.0'
      multiple: false
      supervised: true
      allowmanualinstall: true
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: The payload defines a layout of apps, folders, & web clips for the Home
    screen.
payloadkeys:
- key: Dock
  type: <array>
  presence: optional
  content: An array of dictionaries, each of which must conform to the icon dictionary
    format. If this key isn't present, the user's Dock is empty.
  subkeytype: IconItem
  subkeys: &id001
  - key: IconItem
    type: <dictionary>
    content: An array of dictionaries that conform to the icon dictionary format.
    subkeys:
    - key: Type
      type: <string>
      presence: required
      rangelist:
      - Application
      - Folder
      - WebClip
      content: The type of the Dock item.
    - key: DisplayName
      type: <string>
      presence: optional
      content: The human-readable string shown to the user. This setting is valid
        only if the type is `Folder`.
    - key: BundleID
      type: <string>
      presence: optional
      content: The bundle identifier of the app. This setting is required if the type
        is `Application`.
    - key: Pages
      type: <array>
      presence: optional
      content: An array of arrays of dictionaries, each conforming to the icon dictionary
        format. This setting is valid only if the type is `Folder`.
      subkeytype: PagesItem
      subkeys: &id002
      - key: PagesItem
        type: <array>
        subkeytype: IconItem
        subkeys: *id001
    - key: URL
      supportedOS:
        iOS:
          introduced: '11.3'
      type: <string>
      presence: optional
      content: |-
        The URL of the existing web clip for this item. This setting is required if `type` is `WebClip`. If more than one web clip exists with the same URL, the behavior is undefined.

        Specifying a web clip in this payload doesn't create the web clip. Use the `WebClip` payload to create a web clip.
- key: Pages
  type: <array>
  presence: required
  content: An array of arrays of dictionaries, each of which must conform to the icon
    dictionary format.
  subkeytype: PagesItem
  subkeys: *id002
notes:
- title: ''
  content: |-
    This payload defines a layout of apps, folders, and web clips for the Home Screen. This layout is locked and can't be modified by the user.

    If a Home Screen layout puts more than four items in the iPhone Dock the location of the fifth and succeeding items may be undefined but they will not be omitted.

    To disable deletion of apps, set `allowAppRemoval` to `false` with `Restrictions`.
