title: '802.1X: Global Ethernet'
description: The payload that configures the default fallback global Ethernet interface.
payload:
  payloadtype: com.apple.globalethernet.managed
  supportedOS:
    iOS:
      introduced: '17.0'
      multiple: false
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.13'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '17.0'
      multiple: false
      supervised: false
      allowmanualinstall: true
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: ANY
  type: <any>
  presence: optional
  content: Keys relevant to 802.1X configuration. User enrollment payloads don't support
    the various proxy keys, including `ProxyType`, `ProxyServer`, `ProxyServerPort`,
    `ProxyUsername`, `ProxyPassword`, `ProxyPACURL` and `ProxyPACFallbackAllowed`.
notes:
- title: ''
  content: |-
    This payload's contents contain these profile-specific keys:

    - Interface (String): This payload uses the value `GlobalEthernet`.
    - EAPClientConfiguration (`EAPClientConfiguration`): The dictionary that defines the enterprise profile for the network.
    - SetupModes (String): The type of connection mode, which is either `System` or `Loginwindow`. `System` is the default.
