title: Domains
description: The payload that configures the domains under an organization's management.
payload:
  payloadtype: com.apple.domains
  supportedOS:
    iOS:
      introduced: '8.0'
      multiple: false
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.10'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '2.0'
      multiple: false
      supervised: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    watchOS:
      introduced: n/a
  content: This payload defines web domains that are under an enterprise's management.
payloadkeys:
- key: EmailDomains
  title: Email Domains
  supportedOS:
    visionOS:
      introduced: n/a
  type: <array>
  presence: optional
  content: |-
    An array of domains. Mail marks in red all email addresses that lack a suffix matching any of these strings.

    Available in iOS 8 and later and macOS 10.10 and later.
  subkeys:
  - key: EmailDomainsItem
    type: <string>
    presence: required
    content: An email address.
- key: WebDomains
  title: Web Domains
  supportedOS:
    macOS:
      introduced: n/a
  type: <array>
  presence: optional
  content: |-
    An array of domains. The system considers URLs matching the patterns listed in this property managed.

    Available in iOS 9.3 and later.
  subkeys:
  - key: WebDomainsItem
    type: <string>
- key: SafariPasswordAutoFillDomains
  title: Password Autofill Domains
  supportedOS:
    iOS:
      introduced: '9.3'
      supervised: true
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
  type: <array>
  presence: optional
  content: |-
    An array of domains. Users can only save passwords in Safari from URLs matching the patterns listed here. This property doesn't disable the autofill feature itself.

    Supervised devices or Shared iPads need this property to enable saving passwords in Safari.

    Available in iOS 9.3 and later.
  subkeys:
  - key: SafariPasswordAutoFillDomainsItem
    type: <string>
- key: CrossSiteTrackingPreventionRelaxedDomains
  title: Cross-Site Tracking Prevention Relaxed Domains
  supportedOS:
    iOS:
      introduced: '16.2'
      supervised: true
      allowmanualinstall: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '13.1'
      allowmanualinstall: false
  type: <array>
  presence: optional
  content: |-
    An array of up to 10 strings. URLs matching the patterns listed here have relaxed enforcement of cross-site tracking prevention.

    Available in iOS 16.2 and later and macOS 13.1 and later.
  subkeys:
  - key: CrossSiteTrackingPreventionRelaxedDomainItem
    type: <string>
- key: CrossSiteTrackingPreventionRelaxedApps
  title: Cross-Site Tracking Prevention Relaxed Apps
  supportedOS:
    iOS:
      introduced: '18.0'
      supervised: true
      allowmanualinstall: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '15.0'
      allowmanualinstall: false
  type: <array>
  presence: optional
  content: |-
    An array of up to 10 strings representing app bundle-ids. Apps matching the bundle-ids listed here have relaxed enforcement of cross-site tracking prevention for the domains listed in `CrossSiteTrackingPreventionRelaxedDomains`.

    Available in iOS 18 and later and macOS 15 and later.
  subkeys:
  - key: CrossSiteTrackingPreventionRelaxedAppsItem
    type: <string>
notes:
- title: ''
  content: |-
    The `WebDomains`, `SafariPasswordAutoFillDomains`, and `CrossSiteTrackingPreventionRelaxedDomains` keys are arrays containing strings that use the following matching patterns:

    - `example.com`: Any path under `example.com` matches, but not `site.example.com`.
    - `foo.example.com`: Any path under `foo.example.com` matches, but not `example.com` or `bar.example.com`.
    - `\*.example.com`: Any path under `foo.example.com` or `bar.example.com` matches, but not `example.com`.
    - `example.com/sub`: `example.com/sub` and any path under it matches, but not `example.com`.
    - `foo.example.com/sub`: Any path under `foo.example.com/sub` matches, but not `example.com`, `example.com/sub`, `foo.example.com/`, or `bar.example.com/sub`.
    - `\*.example.com/sub`: Any path under `foo.example.com/sub` or `bar.example.com/sub` matches, but not `example.com` or `foo.example.com/`.
    - `\*.co`: Any path under `example.co` or `betterbag.co` matches, but not `example.co.uk` or `example.com`.

    A URL that begins with the prefix `www.` is treated as though it doesn't contain that prefix during matching. For example, `http://www.example.com/store` is matched as `http://example.com/store`.

    Trailing slashes are ignored.

    If a domain string contains a port number, the system considers only addresses that specify that port number managed. Otherwise, the system matches the domain without regard to the port number specified. For example, the pattern `*.example.com:8080` matches `http://site.example.com:8080/page.html` but not `http://site.example.com/page.html`, while the pattern `*.example.com` matches both URLs.
